Revit 2026 API

# FluidTypeGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<FluidTemperature> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of FluidTemperature)
```
```cpp
public:
virtual IEnumerator<FluidTemperature^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<FluidTemperature>
override GetEnumerator : unit -> IEnumerator<FluidTemperature>
```

#### Return Value

IEnumeratorFluidTemperatureAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace